Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: supplying a fuel from a fuel source (310; 410; 510; 610) to a burner (306; 406; 506; 606) of the core assembly and to the fuel cell (430; 530; 630);
de_de: Zuführen eines Brennstoffs aus einer Brennstoffquelle (310; 410; 510; 610) zu einem Brenner (306; 406; 506; 606) der Kernbaugruppe und zu der Brennstoffzelle (430; 530; 630);

source: extracting water from a core flow (316; 416; 516; 616) of the core assembly using a core condenser (320; 420; 520; 620) arranged downstream from the burner (306; ... 606) in a direction of the core flow (316; … 616);
de_de: Extrahieren von Wasser aus einer Kernströmung (316; 416; 516; 616) der Kernbaugruppe anhand eines Kernkondensators (320; 420; 520; 620), der in einer Richtung der Kernströmung (316; … 616) dem Brenner (306; … 606) nachgelagert angeordnet ist;

source: collecting water from the core condenser (320; … 620) and/or the fuel cell (430; 530; 630);
de_de: Sammeln von Wasser aus dem Kernkondensator (320; … 620) und/oder der Brennstoffzelle (430; 530; 630);

source: injecting at least a portion of the collected water into the core flow (316; … 616) at a compressor section (304; 404; 504; 604), the burner (306; … 606), and/or a turbine section (308; 408; 508; 608), of the core assembly; and
de_de: Einspritzen mindestens eines Teils des gesammelten Wassers in den Kernstrom (316; … 616) an einem Kompressorabschnitt (304; 404; 504; 604), dem Brenner (306; … 606) und/oder einem Turbinenabschnitt (308; 408; 508; 608) der Kernbaugruppe; und

source: thermally coupling the fuel cell (430; 530; 630) to the core condenser (320; … 620) to provide cooling to the fuel cell (430; 530; 630);
de_de: thermisches Koppeln der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (320; … 620), um der Brennstoffzelle (430; 530; 630) Kühlung bereitzustellen;

source: the method optionally further comprising generating steam from the collected water prior to injection into the core flow (316; … 616).
de_de: wobei das Verfahren optional ferner das Erzeugen von Dampf aus dem gesammelten Wasser vor dem Einspritzen in den Kernstrom (316; … 616) umfasst.

source: The method of claim 10, wherein the thermal coupling of the fuel cell (430; 530; 630) to the core condenser (320; … 620) comprises directing water from the collected water through the core condenser (320; … 620) and into a cooling element (442) of the fuel cell (430; 530; 630).
de_de: Verfahren nach Anspruch 10, wobei die thermische Kopplung der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (320; … 620) das Leiten von Wasser aus dem gesammelten Wasser durch den Kernkondensator (320; … 620) und in ein Kühlelement (442) der Brennstoffzelle (430; 530; 630) umfasst.

source: The method of claim 10, wherein the thermal coupling of the fuel cell (430; 530; 630) to the core condenser (320; 420; 520; 620) comprises mounting at least a portion of the fuel cell (430; 530; 630) to the core condenser (320; 420; 520; 620).
de_de: Verfahren nach Anspruch 10, wobei das thermische Koppeln der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (320; 420; 520; 620) ein Befestigen mindestens eines Teils der Brennstoffzelle (430; 530; 630) an dem Kernkondensator (320; 420; 520; 620) umfasst.

source: The method of claim 10, wherein the thermal coupling of the fuel cell (430; 530; 630) to the core condenser (320; … 620) comprises a closed-loop cooling cycle thermally connecting the fuel cell (430; 530; 630) to the core condenser (320; 420; 520; 620).
de_de: Verfahren nach Anspruch 10, wobei die thermische Kopplung der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (320; … 620) einen geschlossenen Kühlkreislauf umfasst, der die Brennstoffzelle (430; 530; 630) thermisch mit dem Kernkondensator (320; 420; 520; 620) verbindet.

source: The method of any of claims 10 to 13, further comprising:
de_de: Verfahren nach einem der Ansprüche 10 bis 13, ferner umfassend:

source: generating 50% or greater of the collected water from the core flow (316; … 616) passing through the core condenser (320; ... 620) during a high power operation of the core assembly, wherein the high power operation is defined as an operational mode where the core assembly is operated at 50% of maximum corrected thrust or greater; and
de_de: Erzeugen von 50 % oder mehr des gesammelten Wassers aus dem Kernstrom (316; … 616), der während eines Hochleistungsbetriebs der Kernbaugruppe durch den Kernkondensator (320; … 620) strömt, wobei der Hochleistungsbetrieb als ein Betriebsmodus definiert ist, bei dem die Kernbaugruppe mit 50 % des maximal korrigierten Schubs oder mehr betrieben wird; und

source: generating 50% or greater of the collected water from the fuel cell (430; 530; 630) during a low power operation of the core assembly, wherein the low power operation is defined as an operational mode where the core assembly is operated at less than 50% of maximum corrected thrust.
de_de: Erzeugen von 50 % oder mehr des gesammelten Wassers aus der Brennstoffzelle (430; 530; 630) während eines Niedrigleistungsbetriebs der Kernbaugruppe, wobei der Niedrigleistungsbetrieb als ein Betriebsmodus definiert ist, bei dem die Kernbaugruppe mit weniger als 50 % des maximal korrigierten Schubs betrieben wird.

source: generating 50% or greater of the collected water from the core flow (316; … 616) passing through the core condenser (320; … 620) in response to a high throttle lever angle, wherein the high throttle lever angle is defined as a position of a throttle of an aircraft being positioned at 50% or greater of a full span of throttle movement; and
de_de: Erzeugen von 50 % oder mehr des gesammelten Wassers aus dem Kernstrom (316; … 616), der durch den Kernkondensator (320; … 620) strömt, als Reaktion auf einen hohen Gashebelwinkel, wobei der hohe Gashebelwinkel als eine Position eines Gashebels eines Flugzeugs definiert ist, die bei 50 % oder mehr einer vollen Gashebelbewegungsspanne positioniert ist; und

source: generating 50% or greater of the collected water from the fuel cell (430; 530; 630) response to a low throttle lever angle, wherein the low throttle lever angle is defined as a position of a throttle of an aircraft being positioned at below 50% of a full span of throttle movement.
de_de: Erzeugen von 50 % oder mehr des gesammelten Wassers aus der Brennstoffzelle (430; 530; 630) als Reaktion auf einen niedrigen Gashebelwinkel, wobei der niedrige Gashebelwinkel als eine Position eines Gashebels eines Flugzeugs definiert ist, die unter 50 % einer vollen Gashebelbewegungsspanne positioniert ist.

source: 1. A latch assembly (48) comprising:
de_de: 1. Verriegelungsanordnung (48), umfassend:

source: a handle (64);
de_de: einen Griff (64);

source: a hook (66) rotatably mounted to the handle (64) at a first rotational axis (116), the hook (66) including a hook body, the hook body including a first lateral portion (110) and a second lateral portion (112), the first lateral portion (110) laterally spaced from the second lateral portion (112);
de_de: einen Haken (66), der an einer ersten Drehachse (116) drehbar an dem Griff (64) montiert ist, wobei der Haken (66) einen Hakenkörper aufweist, der einen ersten Seitenabschnitt (110) und einen zweiten Seitenabschnitt (112) aufweist, wobei der erste Seitenabschnitt (110) seitlich von dem zweiten Seitenabschnitt (112) beabstandet ist;

source: a first link (68) laterally between the first lateral portion (110) and the second lateral portion (112), the first link (68) rotatably mounted to the first lateral portion (110) and the second lateral portion (112) at the first rotational axis (116); and
de_de: ein erstes Verbindungsstück (68) seitlich zwischen dem ersten Seitenabschnitt (110) und dem zweiten Seitenabschnitt (112), wobei das erste Verbindungsstück (68) an der ersten Drehachse (116) drehbar an dem ersten Seitenabschnitt (110) und dem zweiten Seitenabschnitt (112) montiert ist; und

source: a second link (70) laterally between the first lateral portion (110) and the second lateral portion (112), the second link (70) rotatably mounted to the first link (68) at a second rotational axis (172), the second link (70) configured for translation relative to the first lateral portion (110) and the second lateral portion (112).
de_de: ein zweites Verbindungsstück (70) seitlich zwischen dem ersten Seitenabschnitt (110) und dem zweiten Seitenabschnitt (112), wobei das zweite Verbindungsstück (70) an einer zweiten Drehachse (172) drehbar an dem ersten Verbindungsstück (68) montiert ist und das zweite Verbindungsstück (70) für eine Translation relativ zu dem ersten Seitenabschnitt (110) und dem zweiten Seitenabschnitt (112) konfiguriert ist.

source: 2. The latch assembly (48) of claim 1, wherein:
de_de: 2. Verriegelungsanordnung (48) nach Anspruch 1, wobei:

source: the first lateral portion (110) includes a first slot (118);
de_de: der erste Seitenabschnitt (110) einen ersten Schlitz (118) aufweist;

source: the second lateral portion (112) includes a second slot (124); and
de_de: der zweite Seitenabschnitt (112) einen zweiten Schlitz (124) aufweist; und

source: the second link (70) is positioned within the first slot (118) and the second slot (124).
de_de: das zweite Verbindungsstück (70) innerhalb des ersten Schlitzes (118) und des zweiten Schlitzes (124) positioniert ist.

source: 3. The latch assembly (48) of claim 2, wherein:
de_de: 3. Verriegelungsanordnung (48) nach Anspruch 2, wobei:

source: the first slot (118) extends longitudinally within the first lateral portion (110); and
de_de: der erste Schlitz (118) sich in Längsrichtung innerhalb des ersten Seitenabschnitts (110) erstreckt; und

source: the second slot (124) extends longitudinally within the second lateral portion (112).
de_de: der zweite Schlitz (124) sich in Längsrichtung innerhalb des zweiten Seitenabschnitts (112) erstreckt.

source: 4. The latch assembly (48) of claim 2 or 3, wherein the second link (70) includes a cylindrical body (158), the cylindrical body (158) positioned within the first slot (118) and the second slot (124), optionally wherein the hook (66) is configured for rotation about the cylindrical body (158).
de_de: 4. Verriegelungsanordnung (48) nach Anspruch 2 oder 3, wobei das zweite Verbindungsstück (70) einen zylindrischen Körper (158) aufweist, wobei der zylindrische Körper (158) innerhalb des ersten Schlitzes (118) und des zweiten Schlitzes (124) positioniert ist, wobei optional der Haken (66) zur Drehung um den zylindrischen Körper (158) konfiguriert ist.

source: 5. The latch assembly (48) of any preceding claim, wherein the first link (68) is rotatably mounted to the handle (64) at a third rotational axis (152).
de_de: 5. Verriegelungsanordnung (48) nach einem der vorhergehenden Ansprüche, wobei das erste Verbindungsstück (68) an einer dritten Drehachse (152) drehbar an dem Griff (64) montiert ist.

source: 6. The latch assembly (48) of claim 5, wherein the handle (64) forms a first handle slot (96) and a second handle slot (98), the first link (68) rotatably mounted to the handle (64) within the first handle slot (96) and the second handle (98) slot.
de_de: 6. Verriegelungsanordnung (48) nach Anspruch 5, wobei der Griff (64) einen ersten Griffschlitz (96) und einen zweiten Griffschlitz (98) bildet, wobei das erste Verbindungsstück (68) innerhalb des ersten Griffschlitzes (96) und des zweiten Griffschlitzes (98) drehbar an dem Griff (64) montiert ist.

source: 7. The latch assembly (48) of any preceding claim, wherein:
de_de: 7. Verriegelungsanordnung (48) nach einem der vorhergehenden Ansprüche, wobei:

source: the hook body extends from a first longitudinal end (100) to a second longitudinal end (102);
de_de: sich der Hakenkörper von einem ersten Längsende (100) zu einem zweiten Längsende (102) erstreckt;

source: the hook body further includes a hook portion (108) at the first longitudinal end (100); and
de_de: der Hakenkörper ferner einen Hakenabschnitt (108) an dem ersten Längsende (100) aufweist; und

source: the first lateral portion (110) and the second lateral portion (112) extend from the hook portion (108) to the second longitudinal end (102), optionally wherein the first rotational axis (116) is positioned at the second longitudinal end (102).
de_de: der erste Seitenabschnitt (110) und der zweite Seitenabschnitt (112) sich von dem Hakenabschnitt (108) zu dem zweiten Längsende (102) erstrecken, wobei optional die erste Drehachse (116) an dem zweiten Längsende (102) positioniert ist.

source: 8. The latch assembly (48) of any preceding claim, wherein the handle (64) includes a latch release member (72), the latch release member (72) positionable in a latched position and an unlatched position, the latch release member (72) configured to contact the first lateral portion (110) and the second lateral portion (112) in the latched position.
de_de: 8. Verriegelungsanordnung (48) nach einem der vorhergehenden Ansprüche, wobei der Griff (64) ein Verriegelungsfreigabeelement (72) aufweist, wobei das Verriegelungsfreigabeelement (72) in einer verriegelten und einer entriegelten Position positionierbar ist, wobei das Verriegelungsfreigabeelement (72) konfiguriert ist, um in der verriegelten Position den ersten Seitenabschnitt (110) und den zweiten Seitenabschnitt (112) zu berühren.

source: 9. The latch assembly (48) of claim 1, wherein the second link (70) includes a cylindrical body (158), the cylindrical body (158) extending laterally through the first lateral portion (110) and the second lateral portion (112).
de_de: 9. Verriegelungsanordnung (48) nach Anspruch 1, wobei das zweite Verbindungsstück (70) einen zylindrischen Körper (158) aufweist, wobei sich der zylindrische Körper (158) seitlich durch den ersten Seitenabschnitt (110) und den zweiten Seitenabschnitt (112) erstreckt.

source: The latch assembly (48) of claim 9, wherein the first lateral portion (110) and the second lateral portion (112) are configured to translate relative to the cylindrical body (158).
de_de: Verriegelungsanordnung (48) nach Anspruch 9, wobei der erste Seitenabschnitt (110) und der zweite Seitenabschnitt (112) konfiguriert sind, um sich relativ zu dem zylindrischen Körper (158) zu verschieben.

source: The latch assembly (48) of claim 9 or 10, wherein:
de_de: Verriegelungsanordnung (48) nach Anspruch 9 oder 10, wobei:

source: the hook body extends from a first longitudinal end (100) to a second longitudinal end (102); and
de_de: sich der Hakenkörper von einem ersten Längsende (100) zu einem zweiten Längsende (102) erstreckt; und

source: the hook body further includes a hook portion (108) at the first longitudinal end (100), the first lateral portion (110) and the second lateral portion (112) extending from the hook portion (108) to the second longitudinal end (102), optionally wherein:
de_de: der Hakenkörper ferner einen Hakenabschnitt (108) an dem ersten Längsende (100) aufweist, wobei sich von dem Hakenabschnitt (108) der erste Seitenabschnitt (110) und der zweite Seitenabschnitt (112) zu dem zweiten Längsende (102) erstrecken, wobei optional:

source: the second link (70) is positioned longitudinally between the first link (68) and the hook body; and/or
de_de: das zweite Verbindungsstück (70) in Längsrichtung zwischen dem ersten Verbindungsstück (68) und dem Hakenkörper positioniert ist; und/oder

source: the first rotational axis (116) is positioned at the second longitudinal end (102).
de_de: die erste Drehachse (116) an dem zweiten Längsende (102) positioniert ist.

source: The latch assembly (48) of any of claims 9 to 11, wherein the hook (66) is configured for rotation about the cylindrical body (158).
de_de: Verriegelungsanordnung (48) nach einem der Ansprüche 9 bis 11, wobei der Haken (66) zur Drehung um den zylindrischen Körper (158) konfiguriert ist.

source: The latch assembly (48) of claim 1, further comprising:
de_de: Verriegelungsanordnung (48) nach Anspruch 1, ferner umfassend:

source: a first latch portion (50) including a keeper (56); and
de_de: einen ersten Verriegelungsabschnitt (50), aufweisend einen Halter (56); und

source: a second latch portion (52) including: the handle (64), the hook (66), the first link (68) and the second link (70), the hook body including a hook portion (108), the hook portion (108) configured to selectively engage the keeper (56), the first lateral portion (110) and the second lateral portion (112) extending longitudinally from the hook portion (108).
de_de: einen zweiten Verriegelungsabschnitt (52), Folgendes aufweisend: den Griff (64), den Haken (66), das erste Verbindungsstück (68) und das zweite Verbindungsstück (70), den Hakenkörper aufweisend einen Hakenabschnitt (108), wobei der Hakenabschnitt (108) konfiguriert ist, um selektiv mit dem Halter (56) in Eingriff zu kommen, wobei sich der erste Seitenabschnitt (110) und der zweite Seitenabschnitt (112) in Längsrichtung von dem Hakenabschnitt (108) erstrecken.

source: The latch assembly (48) of claim 13, further comprising a first cowl door (42) and a second cowl door (44), the first cowl door (42) including the first latch portion (50) and the second cowl door (44) including the second latch portion (52).
de_de: Verriegelungsanordnung (48) nach Anspruch 13, ferner eine erste Motorhaubentür (42) und eine zweite Motorhaubentür (44) umfassend, wobei die erste Motorhaubentür (42) den ersten Verriegelungsabschnitt (50) aufweist und die zweite Motorhaubentür (44) den zweiten Verriegelungsabschnitt (52) aufweist.

source: The latch assembly (48) of claim 13 or 14, wherein the hook body extends from a first longitudinal end (100) to a second longitudinal end (102), the hook portion (108) at the first longitudinal end (100), the first lateral portion (110) and the second lateral portion (112) extending from the hook portion (108) to the second longitudinal end (102), optionally wherein the first link (68) and the second link (70) are longitudinally between the hook portion (108) and the second longitudinal end (102).
de_de: Verriegelungsanordnung (48) nach Anspruch 13 oder 14, wobei sich der Hakenkörper von einem ersten Längsende (100) zu einem zweiten Längsende (102) erstreckt, sich der Hakenabschnitt (108) an dem ersten Längsende (100), der erste Seitenabschnitt (110) und der zweite Seitenabschnitt (112) von dem Hakenabschnitt (108) zu dem zweiten Längsende (102) erstrecken, wobei sich optional das erste Verbindungsstück (68) und das zweite Verbindungsstück (70) in Längsrichtung zwischen dem Hakenabschnitt (108) und dem zweiten Längsende (102) befinden.

source: 1. A de-aerator (36) for an oil system (30) of a gas turbine engine (20), comprising:
de_de: 1. Entlüfter (36) für ein Ölsystem (30) eines Gasturbinentriebwerks (20), umfassend:

source: a body (44) extending between a first axial end (66) and a second axial end (68) opposite the first axial end (66), the body (44) having at least one sidewall (58) that extends between the first axial end (66) and the second axial end (68), and a base panel (60) connected to the at least one sidewall (58) at the second axial end (68), wherein the base panel (60) and the at least one sidewall (58) define an internal cavity (62) of the body (44);
de_de: einen Körper (44), der sich zwischen einem ersten axialen Ende (66) und einem dem ersten axialen Ende (66) gegenüberliegenden zweiten axialen Ende (68) erstreckt, wobei der Körper (44) mindestens eine Seitenwand (58) aufweist, die sich zwischen dem ersten axialen Ende (66) und dem zweiten axialen Ende (68) erstreckt, und eine Basisplatte (60), die mit der mindestens einen Seitenwand (58) an dem zweiten axialen Ende (68) verbunden ist, wobei die Basisplatte (60) und die mindestens eine Seitenwand (58) einen inneren Hohlraum (62) des Körpers (44) definieren;

source: a cover panel (56) connected to the body (44) at the first axial end (66);
de_de: eine Abdeckplatte (56), die an dem ersten axialen Ende (66) mit dem Körper (44) verbunden ist;

source: a fluid inlet (42) in communication with the body (44) at the first axial end (66), the fluid inlet (42) having an internal flow passage (70) configured to direct fluid tangentially into the internal cavity (62);
de_de: einen Fluideinlass (42), der mit dem Körper (44) an dem ersten axialen Ende (66) in Kommunikation ist, wobei der Fluideinlass (42) einen inneren Strömungsdurchgang (70) aufweist, der konfiguriert ist, um Fluid tangential in den inneren Hohlraum (62) zu leiten;

source: a helical fluid passage (46) disposed within the internal cavity (62) having an entry end (74) and an exit end (76), the entry end (74) disposed to receive fluid from the fluid inlet (42), the helical fluid passage (46) having a plurality of circumferential turns that collectively axially descend toward the second axial end (68) of the body (44), wherein the circumferential turns each include one or more air passages disposed radially inward providing a gas path to a central region (84) disposed radially inside of the helical fluid passage (46);
de_de: einen schraubenförmigen Fluiddurchgang (46), der innerhalb des inneren Hohlraums (62) angeordnet ist und ein Eintrittsende (74) und ein Austrittsende (76) aufweist, wobei das Eintrittsende (74) angeordnet ist, um Fluid von dem Fluideinlass (42) aufzunehmen, wobei der schraubenförmige Fluiddurchgang (46) eine Vielzahl von Umfangswindungen aufweist, die gemeinsam axial zu dem zweiten axialen Ende (68) des Körpers (44) hinabführen, wobei die Umfangswindungen jeweils einen oder mehrere radial nach innen angeordnete Luftdurchgänge beinhalten, die einen Gasweg zu einem zentralen Bereich (84) bereitstellen, der radial innerhalb des schraubenförmigen Fluiddurchgangs (46) angeordnet ist;

source: at least one partition (54) disposed within the internal cavity (62) in a plane that is substantially perpendicular to a central axis (64) of the de-aerator (36), at or below the exit end of the helical fluid passage (46), and spaced above the base panel (60) of the de-aerator (36) wherein the at least one partition (54) has an upper surface (54U), a lower surface (54L), a thickness (90) extending between the upper surface (54U) and the lower surface (54L); and
de_de: mindestens eine Trennwand (54), die innerhalb des inneren Hohlraums (62) in einer Ebene angeordnet ist, die im Wesentlichen senkrecht zu einer Mittelachse (64) des Entlüfters (36) ist, an oder unter dem Austrittsende des schraubenförmigen Fluiddurchgangs (46) und oberhalb der Basisplatte (60) des Entlüfters (36) beabstandet, wobei die mindestens eine Trennwand (54) eine obere Fläche (54U), eine untere Fläche (54L) und eine Dicke (90) aufweist, die sich zwischen der oberen Fläche (54U) und der unteren Fläche (54L) erstreckt; und

source: at least one fluid outlet (48) disposed adjacent the base panel (60), the at least one fluid outlet (48) configured to permit liquid passage from the internal cavity (62) of the body (44) to outside the body (44),
de_de: mindestens einen Flüssigkeitsauslass (48), der benachbart zu der Basisplatte (60) angeordnet ist, wobei der mindestens eine Flüssigkeitsauslass (48) konfiguriert ist, um Flüssigkeitsdurchgang aus dem inneren Hohlraum (62) des Körpers (44) nach außerhalb des Körpers (44) zu ermöglichen,

source: characterised in that
de_de: dadurch gekennzeichnet, dass

source: the at least one partition (54) has a plurality of apertures (94) extending through the partition (54) between the upper surface (54U) and the lower surface (54L).
de_de: die mindestens eine Trennwand (54) eine Vielzahl von Aussparungen (94) aufweist, die sich durch die Trennwand (54) zwischen der oberen Fläche (54U) und der unteren Fläche (54L) erstrecken.
